test/nexj/core/persistence/sql/data/readOffset.xml


<!-- Copyright 2010 NexJ Systems Inc. This software is licensed under the terms of the Eclipse Public License 1.0 -->
<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[2]">
            <Item href="#a"/>
            <Item href="#b"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[4]">
            <Item>lastName</Item>
            <Item>addresses</Item>
            <Item>firstName</Item>
            <Item>user</Item>
         </keys>
         <values nc:arrayType="xs:anyType[4]">
            <Item xi:type="xs:string">Test</Item>
            <Item href="#c"/>
            <Item xi:type="xs:string">Joe</Item>
            <Item href="#d"/>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAw==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[4]">
            <Item>lastName</Item>
            <Item>addresses</Item>
            <Item>firstName</Item>
            <Item>user</Item>
         </keys>
         <values nc:arrayType="xs:anyType[4]">
            <Item xi:type="xs:string">Smith</Item>
            <Item href="#e"/>
            <Item xi:type="xs:string">John</Item>
            <Item href="#f"/>
         </values>
      </ns:TransferObject>
      <ns:Array id="c">
         <items nc:arrayType="xs:anyType[2]">
            <Item href="#g"/>
            <Item href="#h"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="d">
         <class>User</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[1]">
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:string">jtest</Item>
         </values>
      </ns:TransferObject>
      <ns:Array id="e">
         <items nc:arrayType="xs:anyType[2]">
            <Item href="#i"/>
            <Item href="#j"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="f">
         <class>User</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAg==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[1]">
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:string">jsmith</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="g">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[4]">
            <Item>street</Item>
            <Item>country</Item>
            <Item>city</Item>
            <Item>code</Item>
         </keys>
         <values nc:arrayType="xs:anyType[4]">
            <Item xi:type="xs:string">100 Front St E</Item>
            <Item xi:type="xs:string">Canada</Item>
            <Item xi:type="xs:string">Toronto</Item>
            <Item xi:type="xs:string">M5A 1E1</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="h">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAg==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[4]">
            <Item>street</Item>
            <Item>country</Item>
            <Item>city</Item>
            <Item>code</Item>
         </keys>
         <values nc:arrayType="xs:anyType[4]">
            <Item xi:type="xs:string">27 Major Mackenzie Dr E</Item>
            <Item xi:type="xs:string">Canada</Item>
            <Item xi:type="xs:string">Richmond Hill</Item>
            <Item xi:type="xs:string">L4C 1G6</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="i">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABA==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[4]">
            <Item>street</Item>
            <Item>country</Item>
            <Item>city</Item>
            <Item>code</Item>
         </keys>
         <values nc:arrayType="xs:anyType[4]">
            <Item xi:type="xs:string">2240 3rd Rd</Item>
            <Item xi:type="xs:string">USA</Item>
            <Item xi:type="xs:string">Wakefield</Item>
            <Item xi:type="xs:string">67487-9261</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="j">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[4]">
            <Item>street</Item>
            <Item>country</Item>
            <Item>city</Item>
            <Item>code</Item>
         </keys>
         <values nc:arrayType="xs:anyType[4]">
            <Item xi:type="xs:string">1234 4th Rd</Item>
            <Item xi:type="xs:string">USA</Item>
            <Item xi:type="xs:string">Sutphen</Item>
            <Item xi:type="xs:string">67480-1234</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
